Reports/гф_Отчет_receivablec.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>гф_Отчет_receivablec</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сезон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гф_Бюджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛимита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/гф_Отчет_receivablec/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
    Синоним = ЭтотОбъект.Метаданные().Синоним; 
    РегистрационныеДанные = Новый Структура;
    РегистрационныеДанные.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет());
	РегистрационныеДанные.Вставить("Наименование", Синоним);
    РегистрационныеДанные.Вставить("Версия", "1.0");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
    РегистрационныеДанные.Вставить("Информация", "Отчет "+Синоним);
    
    ТаблицаКоманд = ПолучитьТаблицуКоманд();
    
    // Добавим команду в таблицу
    ДобавитьКоманду(ТаблицаКоманд, Синоним, "СформироватьОтчет" , "ОткрытиеФормы", Истина, );
        
    // Сохраним таблицу команд в параметры регистрации обработки
    РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
    
    Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
    
    // Создадим пустую таблицу команд и колонки в ней
    Команды = Новый ТаблицаЗначений;

    // Как будет выглядеть описание печатной формы для пользователя
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 

    // Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));

    // Тут задается, как должна вызваться команда обработки
    // Возможные варианты:
    // - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
    // - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
    // - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));

    // Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));

    // Для печатной формы должен содержать строку ПечатьMXL 
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
   
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор)
    
    // Добавляем команду в таблицу команд по переданному описанию.
    // Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)  
	СтандартнаяОбработка=Ложь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	//ПечатьТаблицыРассчёты(ДокументРезультат);    
	ТаблицаДляСКД =	ПолучитьФинальнуюТаблицуДляСКД();

	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Данные", ТаблицаДляСКД);
	КомпоновщикМакета 		= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Процедура ПолучитьТаблицуРассчёты(ДокументРезультат)
	СтандартнаяОбработка = Ложь;
	//Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	//Данные.Очистить();
	//ДокументРезультат.Очистить();
	//ТаблицаДляСКД =	ПолучитьФинальнуюТаблицуДляСКД();

	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("Данные", ТаблицаДляСКД);
	//КомпоновщикМакета 		= Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновкиДанных   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	
КонецПроцедуры

Функция ПолучитьСрокПлатежа(Документ)
	
	результат = Документ.Дата;
	
	запрос = новый Запрос(
	"ВЫБРАТЬ
	|	а.Объект КАК Объект,
	|	а.Свойство КАК Свойство,
	|	а.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК а
	|ГДЕ
	|	а.Объект = &Объект
	|	И а.Свойство.Имя = &Свойство");
	запрос.УстановитьПараметр("Объект", Документ);
	запрос.УстановитьПараметр("Свойство", "гф_СчетанаоплатуСрокПлатежа");
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		результат = выборка.Значение;
	КонецЕсли;
	
	возврат результат;
КонецФункции // ()

//Процедура ПечатьТаблицыРассчёты(ДокументРезультат)
//	
//	ПолучитьТаблицуРассчёты(ДокументРезультат);
//	макет = ПолучитьМакет("Макет");
//	
//	строкаПустая = макет.ПолучитьОбласть("строкаПустая");
//	ДокументРезультат.Вывести(строкаПустая);
//	
//	ВыборкаДок = Данные.Выгрузить(, "Контрагент, Сезон, Документ, СуммаДолга");
//	ВыборкаДок.Свернуть("Контрагент, Сезон, Документ", "СуммаДолга");
//	ВыборкаДок.Колонки.Добавить("Дни", новый ОписаниеТипов("Число"));
//	ВыборкаДок.Колонки.Добавить("Отсрочка", новый ОписаниеТипов("Число"));
//	ВыборкаДок.Индексы.Добавить("Контрагент, Документ");
//	
//	// заголовок
//	ЗаголовокЛево = макет.ПолучитьОбласть("Заголовок");
//	ДокументРезультат.Вывести(ЗаголовокЛево);
//	
//	// таблица
//	
//	строкаДокумент = макет.ПолучитьОбласть("строкаДокумент");
//	контрагенты = Данные.Выгрузить(, "Контрагент");
//	контрагенты.Свернуть("Контрагент");
//	контрагенты.Сортировать("Контрагент");
//	Для каждого строкаК Из контрагенты Цикл
//		#Если Клиент Тогда
//			ОбработкаПрерыванияПользователя();
//		#КонецЕсли
//		
//		//СтрокаГруппаКонтрагентТаблица2(строкаК);
//		
//		доки = Данные.Выгрузить(новый Структура("Контрагент", строкаК.Контрагент), "Документ, Сезон, СуммаДолга, Использовано, КВ");
//		доки.Свернуть("Документ, Сезон", "СуммаДолга, Использовано, КВ");
//		доки.Колонки.Добавить("Дата");
//		доки.Колонки.Добавить("Номер");
//		Для каждого строкаД Из доки Цикл
//			строкаД.Дата = строкаД.Документ.Дата;
//			строкаД.Номер = строкаД.Документ.Номер;
//		КонецЦикла;
//		доки.Сортировать("Дата, Номер");
//		
//		Для каждого строкаД Из доки Цикл
//			#Если Клиент Тогда
//				ОбработкаПрерыванияПользователя();
//			#КонецЕсли
//			
//			//СтрокаДокументыТаблица2(строкаД, строкаК.Контрагент, ДокументРезультат, Макет, ВыборкаДок);
//			строкаДокумент = макет.ПолучитьОбласть("строкаДокумент");
//			
//			строкаДокумент.Параметры.КодКонтрагента = строкаК.Контрагент.Код;
//			строкаДокумент.Параметры.Контрагент = строкаК.Контрагент;
//			строкаДокумент.Параметры.Сезон = строкаД.Сезон;
//			строкаДокумент.Параметры.Дата = формат(строкаД.Документ.Дата, "ДФ=dd.MM.yyyy");
//			строкаДокумент.Параметры.Документ = строкаД.Документ;
//			
//			СрокПлатежа = ПолучитьСрокПлатежа(строкаД.Документ);
//			Если ЗначениеЗаполнено(строкаД.Сезон) Тогда
//				Отсрочка = макс(окр((СрокПлатежа - НачалоДня(строкаД.Документ.Дата)) / 3600 / 24, 0), 0);
//				Дни = макс(окр((ДатаОкончания - СрокПлатежа) / 3600 / 24, 0), 0);
//			Иначе
//				Отсрочка = 0;
//				Дни = 0;
//			КонецЕсли;
//			строкаДокумент.Параметры.Отсрочка = Отсрочка;
//			строкаДокумент.Параметры.Дни = Дни;
//			
//			строкаДокумент.Параметры.Сумма = строкаД.СуммаДолга;
//			строкаДокумент.Параметры.Бюджет = строкаД.КВ;
//			
//			ДокументРезультат.Вывести(строкаДокумент);
//		КонецЦикла;
//	КонецЦикла;
//	
//	Итог = Данные.Выгрузить();
//	Итог.Свернуть(, "СуммаДолга, КВ");
//	строкаИтогов = Итог[0];
//	
//	строкаИтог = макет.ПолучитьОбласть("строкаИтог");
//	строкаИтог.Параметры.Сумма = строкаИтогов.СуммаДолга;
//	строкаИтог.Параметры.Бюджет = строкаИтогов.КВ;
//	ДокументРезультат.Вывести(строкаИтог);
//	
//	ДокументРезультат.ФиксацияСверху = 2;
//	ДокументРезультат.ФиксацияСлева = 3;
//	
//КонецПроцедуры

Функция БюджетыКВ()
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	а.Ссылка КАК Ссылка,
	|	а.ТипЛимита КАК ТипЛимита,
	|	а.Бюджет КАК Бюджет
	|ИЗ
	|	Справочник.гф_ВидыЛимитов КАК а
	|ГДЕ
	|	а.ТипЛимита = &ТипЛимита");
	Запрос.УстановитьПараметр("ТипЛимита", Перечисления.гф_ТипыЛимитов.KV);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ()

Функция ПолучитьФинальнуюТаблицуДляСКД();
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	ДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройки, "ДатаОтчета").Значение; 
	Если ТипЗнч(ДатаОтчета) = Тип("СтандартнаяДатаНачала") Тогда
		ДатаОтчета =ДатаОтчета.Дата;
	КонецЕсли;
	//Организация = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройки, "Организация").Значение; 

	//Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	//ПараметрОрганизация 	= Параметры.Элементы.Найти("Организация");
	//Организация = ПараметрОрганизация.Значение;
	//ПараметрДатаОтчета 	= Параметры.Элементы.Найти("ДатаОтчета");
	//ДатаОтчета = ПараметрДатаОтчета.Значение;

	
	СКД_Расчет = ПолучитьМакет("Расчеты");
	НастройкиОтчета = СКД_Расчет.НастройкиПоУмолчанию;
	
	//КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "Организация", 
	//		Организация, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "ДатаОтчета", 
			ДатаОтчета, Истина);
	ДатаОтчетаГраница = Новый Граница(КонецДня(ДатаОтчета), ВидГраницы.Включая);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "ДатаОтчетаГраница", 
			ДатаОтчетаГраница, Истина);
			
	НастройкиОтчета.Отбор.Элементы.Очистить();
	
	НастройкиТекущие = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновкаДанныхКлиентСервер.СкопироватьОтборКомпоновкиДанных(СКД_Расчет, НастройкиОтчета, НастройкиТекущие);

	//КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	//КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД_Расчет));
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);

	БюджетыКВ = БюджетыКВ();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД_Расчет, НастройкиОтчета,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина); 
	
	таб = новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьОбъект(таб);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// ++ Галфинд Волков 18.09.2023
	таб.Свернуть("Организация, Бюджет, Документ, Контрагент, Сезон, Договор, ВидЛимита, ТипЛимита, СуммаЛимита", "СуммаДолга");
	// -- Галфинд Волков 18.09.2023
	
	таб.Колонки.Добавить("Доступно", новый ОписаниеТипов("Число"));
	таб.Колонки.Добавить("Использовано", новый ОписаниеТипов("Число"));
	таб.Колонки.Добавить("КВ", новый ОписаниеТипов("Число"));
	//таб.Колонки.Добавить("Обработано", новый ОписаниеТипов("Булево"));
	
	контрагенты = таб.Скопировать(, "Контрагент");
	контрагенты.Свернуть("Контрагент");
	контрагенты.Сортировать("Контрагент");
	
	БюджетыПустаяСсылка = Справочники.гф_Бюджеты.ПустаяСсылка();
	
	Для каждого строкаК Из контрагенты Цикл
		доки = таб.Скопировать(новый Структура("Контрагент", строкаК.Контрагент), "Документ, Сезон");
		доки.Свернуть("Документ, Сезон");
		Если доки.Количество() >= 1 Тогда
			доки.Колонки.Добавить("Дата");
			доки.Колонки.Добавить("Номер");
			Для каждого строкаД Из доки Цикл
				строкаД.Дата = строкаД.Документ.Дата;
				строкаД.Номер = строкаД.Документ.Номер;
			КонецЦикла;
			доки.Сортировать("Дата, Номер");
		КонецЕсли;
		
		бюджеты = таб.Скопировать(новый Структура("Контрагент", строкаК.Контрагент), "Бюджет, ВидЛимита, ТипЛимита");
		Если бюджеты.Найти(БюджетыПустаяСсылка, "Бюджет") = Неопределено Тогда
			бюджеты.Добавить().Бюджет = БюджетыПустаяСсылка;
		КонецЕсли;
		бюджеты.Свернуть("Бюджет, ВидЛимита, ТипЛимита");
		бюджеты.Колонки.Добавить("Порядок");
		//бюджеты.Колонки.Добавить("ВидЛимитаКод");
		Для каждого строкаБ Из бюджеты Цикл
			Если ЗначениеЗаполнено(строкаБ.Бюджет) Тогда
				строкаБ.Порядок = строкаБ.Бюджет.Порядок;
				//строкаБ.ВидЛимитаКод = строкаБ.ВидЛимита.Код;
			Иначе
				строкаБ.Порядок = 999;
			КонецЕсли;
		КонецЦикла;
		бюджеты.Сортировать("Порядок");
		
		док_пре = Неопределено;
		
		// ++ Галфинд Волков 18.09.2023
		НесколькоДокументов = Ложь;
		Если доки.Количество() > 1 Тогда
			ТабСуммаДолга = Новый ТаблицаЗначений;
			ТабСуммаДолга = таб.СкопироватьКолонки();
			ТабСуммаДолга.Очистить();
			НесколькоДокументов = Истина;
		КонецЕсли;
		// -- Галфинд Волков 18.09.2023
		
		Для каждого строкаД Из доки Цикл
						
			первый_бюджет = Истина;
			СуммаДолга = 0;
			Использовано = 0;
			Для каждого строкаБ Из бюджеты Цикл
				
				нашли = таб.НайтиСтроки(новый Структура("Контрагент, Документ, Бюджет, ВидЛимита, ТипЛимита",
					строкаК.Контрагент, строкаД.Документ, строкаБ.Бюджет, строкаБ.ВидЛимита, строкаБ.ТипЛимита));
				Если нашли.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				строкаТ = нашли[0];
				
				Если первый_бюджет Тогда
					первый_бюджет = Ложь;
				Иначе
					строкаТ.СуммаДолга = СуммаДолга;
				КонецЕсли;
				
				строкаТ.Доступно = строкаТ.СуммаЛимита;
				
				Использовано = ПолучитьИспользовано(таб, строкаК.Контрагент, строкаБ.Бюджет, строкаД.Документ);
				строкаТ.Доступно = макс(строкаТ.СуммаЛимита - Использовано);
				строкаТ.Использовано = Использовано + мин(строкаТ.СуммаДолга, строкаТ.Доступно);
				
				Если ЗначениеЗаполнено(строкаТ.Бюджет) Тогда
					СуммаДолга = макс(строкаТ.СуммаДолга - строкаТ.Доступно, 0);
					строкаТ.СуммаДолга = строкаТ.СуммаДолга - СуммаДолга;
				КонецЕсли;
				
				Если не БюджетыКВ.Найти(строкаБ.Бюджет) = Неопределено Тогда
					строкаТ.КВ = строкаТ.КВ + мин(строкаТ.Использовано, строкаТ.СуммаДолга);
				КонецЕсли;
				
			КонецЦикла;
			
			док_пре = строкаД.Документ;
			
			Если СуммаДолга > 0 Тогда
				новая = таб.Добавить();
				ЗаполнитьЗначенияСвойств(новая, строкаТ, "Организация, Документ, Контрагент, Сезон, Договор");
				//ЗаполнитьЗначенияСвойств(новая, строкаТ);
				новая.СуммаДолга = СуммаДолга;
				новая.Бюджет = БюджетыПустаяСсылка;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	//Для каждого строка Из таб Цикл
	//	ЗаполнитьЗначенияСвойств(Данные.Добавить(), строка);
	//КонецЦикла;
	ТабРезультат = таб.СкопироватьКолонки("Организация, Контрагент, Документ, Сезон, Договор, ВидЛимита, ТипЛимита");
	ТабРезультат.Колонки.Добавить("ДатаДокумента", новый ОписаниеТипов("Дата"));
	ТабРезультат.Колонки.Добавить("ДниОтсрочки", новый ОписаниеТипов("Число"));
	ТабРезультат.Колонки.Добавить("ДниПросрочки", новый ОписаниеТипов("Число"));
	ТабРезультат.Колонки.Добавить("ДолгКлиента", новый ОписаниеТипов("Число"));
	ТабРезультат.Колонки.Добавить("СуммаЛимита", новый ОписаниеТипов("Число"));
	ТабРезультат.Колонки.Добавить("Партнер", новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТабРезультат.Колонки.Добавить("ПартнерКод", новый ОписаниеТипов("Строка"));
	
	Для каждого Стр Из таб Цикл
		НовСтр = ТабРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.Партнер = Стр.Контрагент.Партнер;
		НовСтр.ПартнерКод = НовСтр.Партнер.Код;
		НовСтр.ДатаДокумента = Стр.Документ.Дата;
		СрокПлатежа = ПолучитьСрокПлатежа(Стр.Документ);
		Если ЗначениеЗаполнено(Стр.Сезон) Тогда
			Отсрочка = макс(окр((СрокПлатежа - НачалоДня(НовСтр.ДатаДокумента)) / 3600 / 24, 0), 0);
			Дни = макс(окр((ДатаОтчета - СрокПлатежа) / 3600 / 24, 0), 0);
		Иначе
			Отсрочка = 0;
			Дни = 0;
		КонецЕсли;
		НовСтр.ДниОтсрочки = Отсрочка;
		НовСтр.ДниПросрочки = Дни;
		НовСтр.ДолгКлиента = Стр.СуммаДолга;
		НовСтр.СуммаЛимита = Стр.КВ;
	
	КонецЦикла;
	Возврат ТабРезультат;
КонецФункции // ()

Функция ПолучитьИспользовано(таб, Контрагент, Бюджет, Документ)
	
	Если не ЗначениеЗаполнено(Бюджет) Тогда
		возврат 0;
	КонецЕсли;
	
	набор = таб.Скопировать(новый Структура("Контрагент, Бюджет", Контрагент, Бюджет));
	нашли = набор.Найти(Документ, "Документ");
	а = набор.Индекс(нашли);
	Если а = 0 Тогда
		возврат 0;
	Иначе
		возврат набор[а-1].Использовано;
	КонецЕсли;
	
КонецФункции // ()
